//Персональные данные.
// Напишите программу, которая выводит приведенную ниже информацию:
//•ваше имя;
//•ваш адрес проживания, с городом, областью и почтовым индексом;
//•ваш номер телефона;
//•вашу специализацию в учебном заведении.

#include <stdio.h>

int main() {
    printf("Персональные данные:\n");
    printf("Имя: Юрий\n");
    printf("Адрес: Нижневартовск\n");
    printf("Телефон: +7(999)999-99-99\n");
    printf("Студент\n");
    return 0;
}